# PROYECTO 1

## Ejercicio 1

In [1]:
import pandas as pd
import numpy as np

In [22]:
diccionario = {
    "Fecha": ["12-01-2022","13-01-2022","14-01-2022","15-01-2022"],
    "Precio Unit":[15.50, 3.50, 2.20,5],
    "Ventas":[23, 40, 100, 76]
}

df = pd.DataFrame(diccionario)

In [23]:
df

        Fecha  Precio Unit  Ventas
0  12-01-2022         15.5      23
1  13-01-2022          3.5      40
2  14-01-2022          2.2     100
3  15-01-2022          5.0      76

In [24]:
df['Ganancia'] = df['Ventas']*df['Precio Unit']
df['Ganancia - Desc 5%'] = (df['Precio Unit'] - df['Precio Unit']*0.005).round(2)*df['Ventas']

In [25]:
df

        Fecha  Precio Unit  Ventas  Ganancia  Ganancia - Desc 5%
0  12-01-2022         15.5      23     356.5              354.66
1  13-01-2022          3.5      40     140.0              139.20
2  14-01-2022          2.2     100     220.0              219.00
3  15-01-2022          5.0      76     380.0              377.72

## Ejercicio 2

In [43]:
ingreso = {
    "empleado1":200,
    "empleado2":435,
    "empleado3":567,
    "empleado4":123,
    "empleado5":657,
    "empleado6":876,
    "empleado7":1023
}

tr = pd.DataFrame(ingreso.values())
tr.describe().round(1)

            0
count     7.0
mean    554.4
std     331.6
min     123.0
25%     317.5
50%     567.0
75%     766.5
max    1023.0

## Ejercicio 3

In [44]:
dict3 = {
    "Mes":["Enero", "Febrero", "Marzo", "Abril", "Mayo"],
    "Ventas":[30500, 35600, 28300, 33900, 42500],
    "Gastos":[22000, 23450, 18100, 35700, 32450]
}

In [46]:
df3 = pd.DataFrame(dict3)
df3

       Mes  Ventas  Gastos
0    Enero   30500   22000
1  Febrero   35600   23450
2    Marzo   28300   18100
3    Abril   33900   35700
4     Mayo   42500   32450